## production: database-tools
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 8 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                            NAME                            |
|----------|------------------------------------------------------------|
| update   | `aws_ecs_service.blazer`                                   |
|          | `aws_iam_policy.blazer_exection_role_parameter_policy`     |
|          | `aws_iam_policy.blazer_task_role_policy`                   |
|          | `aws_iam_role.blazer_ecs_task`                             |
|          | `aws_ssm_parameter.db_tools_environment_variables`         |
|          | `aws_ssm_parameter.notify_o11y_google_oauth_client_id`     |
|          | `aws_ssm_parameter.notify_o11y_google_oauth_client_secret` |
|          | `aws_ssm_parameter.sqlalchemy_database_reader_uri`         |
| recreate | `aws_ecs_task_definition.blazer`                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.blazer_exection_role_parameter_policy_actions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "blazer_exection_role_parameter_policy_actions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssmmessages:CreateControlChannel",
              + "ssmmessages:CreateDataChannel",
              + "ssmmessages:OpenControlChannel",
              + "ssmmessages:OpenDataChannel",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:296255494825:parameter/BLAZER_DATABASE_URL",
              + "arn:aws:ssm:ca-central-1:296255494825:parameter/notify_o11y_google_oauth_client_id",
              + "arn:aws:ssm:ca-central-1:296255494825:parameter/notify_o11y_google_oauth_client_secret",
              + "arn:aws:ssm:ca-central-1:296255494825:parameter/sqlalchemy_database_reader_uri",
            ]
        }
    }

  # data.aws_iam_policy_document.blazer_task_role_actions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "blazer_task_role_actions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssmmessages:CreateControlChannel",
              + "ssmmessages:CreateDataChannel",
              + "ssmmessages:OpenControlChannel",
              + "ssmmessages:OpenDataChannel",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:296255494825:parameter/BLAZER_DATABASE_URL",
              + "arn:aws:ssm:ca-central-1:296255494825:parameter/notify_o11y_google_oauth_client_id",
              + "arn:aws:ssm:ca-central-1:296255494825:parameter/notify_o11y_google_oauth_client_secret",
              + "arn:aws:ssm:ca-central-1:296255494825:parameter/sqlalchemy_database_reader_uri",
            ]
        }
    }

  # aws_ecs_service.blazer will be updated in-place
  ~ resource "aws_ecs_service" "blazer" {
        id                                 = "arn:aws:ecs:ca-central-1:296255494825:service/blazer/blazer"
        name                               = "blazer"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:296255494825:task-definition/blazer:11" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.blazer must be replaced
-/+ resource "aws_ecs_task_definition" "blazer" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:296255494825:task-definition/blazer:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:296255494825:task-definition/blazer" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  ~ image            = "296255494825.dkr.ecr.ca-central-1.amazonaws.com/database-tools/blazer:7c144b4" -> "296255494825.dkr.ecr.ca-central-1.amazonaws.com/database-tools/blazer:latest"
                  - mountPoints      = []
                    name             = "blazer"
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "blazer" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_iam_policy.blazer_exection_role_parameter_policy will be updated in-place
  ~ resource "aws_iam_policy" "blazer_exection_role_parameter_policy" {
        id               = "arn:aws:iam::296255494825:policy/blazer_exection_role_parameter_policy"
        name             = "blazer_exection_role_parameter_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:296255494825:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:296255494825:parameter/notify_o11y_google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:296255494825:parameter/notify_o11y_google_oauth_client_id",
                          - "arn:aws:ssm:ca-central-1:296255494825:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.blazer_task_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "blazer_task_role_policy" {
        id               = "arn:aws:iam::296255494825:policy/blazer_task_role_policy"
        name             = "blazer_task_role_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:296255494825:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:296255494825:parameter/notify_o11y_google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:296255494825:parameter/notify_o11y_google_oauth_client_id",
                          - "arn:aws:ssm:ca-central-1:296255494825:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role.blazer_ecs_task will be updated in-place
  ~ resource "aws_iam_role" "blazer_ecs_task" {
        id                    = "blazer-ecs-task"
        name                  = "blazer-ecs-task"
      ~ tags                  = {
          - "CostCenter" = "notification-canada-ca-production" -> null
          + "changeme"   = "notification-canada-ca-production"
        }
      ~ tags_all              = {
          - "CostCenter" = "notification-canada-ca-production" -> null
          + "changeme"   = "notification-canada-ca-production"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ssm_parameter.db_tools_environment_variables will be updated in-place
  ~ resource "aws_ssm_parameter" "db_tools_environment_variables" {
        id              = "BLAZER_DATABASE_URL"
        name            = "BLAZER_DATABASE_URL"
      ~ tags            = {
          - "CostCenter" = "notification-canada-ca-production" -> null
            "Terraform"  = "true"
          + "changeme"   = "notification-canada-ca-production"
        }
      ~ tags_all        = {
          - "CostCenter" = "notification-canada-ca-production" -> null
          + "changeme"   = "notification-canada-ca-production"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.notify_o11y_google_oauth_client_id will be updated in-place
  ~ resource "aws_ssm_parameter" "notify_o11y_google_oauth_client_id" {
        id              = "notify_o11y_google_oauth_client_id"
        name            = "notify_o11y_google_oauth_client_id"
      ~ tags            = {
          - "CostCenter" = "notification-canada-ca-production" -> null
            "Terraform"  = "true"
          + "changeme"   = "notification-canada-ca-production"
        }
      ~ tags_all        = {
          - "CostCenter" = "notification-canada-ca-production" -> null
          + "changeme"   = "notification-canada-ca-production"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.notify_o11y_google_oauth_client_secret will be updated in-place
  ~ resource "aws_ssm_parameter" "notify_o11y_google_oauth_client_secret" {
        id              = "notify_o11y_google_oauth_client_secret"
        name            = "notify_o11y_google_oauth_client_secret"
      ~ tags            = {
          - "CostCenter" = "notification-canada-ca-production" -> null
            "Terraform"  = "true"
          + "changeme"   = "notification-canada-ca-production"
        }
      ~ tags_all        = {
          - "CostCenter" = "notification-canada-ca-production" -> null
          + "changeme"   = "notification-canada-ca-production"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.sqlalchemy_database_reader_uri will be updated in-place
  ~ resource "aws_ssm_parameter" "sqlalchemy_database_reader_uri" {
        id              = "sqlalchemy_database_reader_uri"
        name            = "sqlalchemy_database_reader_uri"
      ~ tags            = {
          - "CostCenter" = "notification-canada-ca-production" -> null
            "Terraform"  = "true"
          + "changeme"   = "notification-canada-ca-production"
        }
      ~ tags_all        = {
          - "CostCenter" = "notification-canada-ca-production" -> null
          + "changeme"   = "notification-canada-ca-production"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 8 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.blazer-task-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_instance.database-tools"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.database-tools-rds-subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.blazer_exection_role_parameter_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.blazer_task_role_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.blazer_ecs_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.blazer_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.db_tools_environment_variables"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.notify_o11y_google_oauth_client_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.notify_o11y_google_oauth_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.sqlalchemy_database_reader_uri"]

35 tests, 19 passed, 16 warnings, 0 failures, 0 exceptions

```

</details>
